package com.edu.di.car.mycar02;

//-----------------------------------------------------------------------------------------------
// public class Car
// 스프링 없이 의존성 주입하기 - 생성자를 통한 의존성 주입
//-----------------------------------------------------------------------------------------------
public class Car {

	Tire tire;
	
	//-----------------------------------------------------------------------------------------------
	// 타이어의 종류를 생성자를 통해서 설정한다.
	//-----------------------------------------------------------------------------------------------
	public Car(Tire tire) {
		this.tire = tire;
	}
	
	public String getTireBrand() {
		return "장착된 타이어는 " + tire.getBrand();
	}
	
} // end - public class Car
